docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rotate Programming Language</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="stylesheet.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Rotate Programming Language</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org42cc5a6">Project Link</a></li>
<li><a href="#org6564234">Basics</a>
<ul>
<li><a href="#org4ca3a99">Hello World</a></li>
<li><a href="#orge88ac98">Comments</a></li>
</ul>
</li>
<li><a href="#org02cc24b">Syntax Overview</a>
<ul>
<li><a href="#org2ca2fdd">Basic variables</a></li>
<li><a href="#org6eef5cf">If Else</a></li>
<li><a href="#org30690a3">Loop</a></li>
<li><a href="#orgd5b93c5">Switch</a></li>
<li><a href="#orgef5b290">Struct</a></li>
<li><a href="#org67ccef2">Function</a></li>
<li><a href="#org763a9f9">Enums</a></li>
<li><a href="#org820d377">Memory Allocation (similar to C, but typed)</a></li>
</ul>
</li>
<li><a href="#org3f3afd2">TODO</a>
<ul>
<li><a href="#org7418759">Compiler</a></li>
<li><a href="#org36b6fe9">DOCS</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org42cc5a6" class="outline-2">
<h2 id="org42cc5a6">Project Link</h2>
<div class="outline-text-2" id="text-org42cc5a6">
<p>
<a href="https://github.com/Airbus5717/rotate-cpp">https://github.com/Airbus5717/rotate-cpp</a>
</p>
</div>
</div>


<div id="outline-container-org6564234" class="outline-2">
<h2 id="org6564234">Basics</h2>
<div class="outline-text-2" id="text-org6564234">
</div>
<div id="outline-container-org4ca3a99" class="outline-3">
<h3 id="org4ca3a99">Hello World</h3>
<div class="outline-text-3" id="text-org4ca3a99">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #a9a1e1;">io</span> :: <span style="color: #51afef;">import</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"std"</span><span style="color: #51afef;">)</span>

<span style="color: #a9a1e1;">main</span> :: <span style="color: #c678dd;">fn</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    io.println<span style="color: #c678dd;">(</span><span style="color: #98be65;">"Hello, World"</span><span style="color: #c678dd;">)</span>
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orge88ac98" class="outline-3">
<h3 id="orge88ac98">Comments</h3>
<div class="outline-text-3" id="text-orge88ac98">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">for single line comments</span>

<span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">  multi-line comments</span>
<span style="color: #5B6268;">*/</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org02cc24b" class="outline-2">
<h2 id="org02cc24b">Syntax Overview</h2>
<div class="outline-text-2" id="text-org02cc24b">
</div>
<div id="outline-container-org2ca2fdd" class="outline-3">
<h3 id="org2ca2fdd">Basic variables</h3>
<div class="outline-text-3" id="text-org2ca2fdd">
<div class="org-src-container">
<pre class="src src-odin">io :: <span style="color: #51afef;">import</span>(<span style="color: #98be65;">"std"</span>)

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">semicolons are optional</span>
x: <span style="color: #ECBE7B;">int</span> = <span style="color: #da8548; font-weight: bold;">1</span>
y := <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">inferred</span>
z :: <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">z is const 3</span>
d := ptr(x) <span style="color: #5B6268;">// </span><span style="color: #5B6268;">type is int*</span>
d = <span style="color: #a9a1e1;">nil</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">now NULL</span>

arr : []<span style="color: #ECBE7B;">int</span> = [<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span>, <span style="color: #da8548; font-weight: bold;">3</span>] <span style="color: #5B6268;">// </span><span style="color: #5B6268;">inferred type ([3]int)</span>
io.println(arr.len) <span style="color: #5B6268;">// </span><span style="color: #5B6268;">arr.len == 3</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6eef5cf" class="outline-3">
<h3 id="org6eef5cf">If Else</h3>
<div class="outline-text-3" id="text-org6eef5cf">
<div class="org-src-container">
<pre class="src src-odin">x := <span style="color: #a9a1e1;">true</span>
y := <span style="color: #a9a1e1;">false</span>
<span style="color: #51afef;">if</span> x {
 <span style="color: #5B6268;">// </span><span style="color: #5B6268;">do stuff</span>
} <span style="color: #51afef;">else</span> <span style="color: #51afef;">if</span> !y {
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">do stuff</span>
} <span style="color: #51afef;">else</span> {
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">do stuff</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org30690a3" class="outline-3">
<h3 id="org30690a3">Loop</h3>
<div class="outline-text-3" id="text-org30690a3">
<div class="org-src-container">
<pre class="src src-odin"><span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #a9a1e1;">..</span><span style="color: #da8548; font-weight: bold;">2</span> {
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">do something</span>
}
x := <span style="color: #a9a1e1;">true</span>
while x {
    <span style="color: #51afef;">break</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd5b93c5" class="outline-3">
<h3 id="orgd5b93c5">Switch</h3>
<div class="outline-text-3" id="text-orgd5b93c5">
<div class="org-src-container">
<pre class="src src-odin">x := <span style="color: #da8548; font-weight: bold;">1</span>
<span style="color: #51afef;">switch</span> x {
    <span style="color: #da8548; font-weight: bold;">1</span>: {}
    <span style="color: #da8548; font-weight: bold;">2</span>: {}
    <span style="color: #51afef;">else</span>:{}
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgef5b290" class="outline-3">
<h3 id="orgef5b290">Struct</h3>
<div class="outline-text-3" id="text-orgef5b290">
<div class="org-src-container">
<pre class="src src-odin">
<span style="color: #ECBE7B;">Token</span> :: <span style="color: #51afef;">struct</span> {
    x: <span style="color: #ECBE7B;">int</span>,
    y: [<span style="color: #da8548; font-weight: bold;">3</span>]<span style="color: #ECBE7B;">int</span>,
}


d := Token{<span style="color: #da8548; font-weight: bold;">1</span>, [<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span>, <span style="color: #da8548; font-weight: bold;">3</span>]}
d.x = <span style="color: #da8548; font-weight: bold;">2</span>
d.y[<span style="color: #da8548; font-weight: bold;">1</span>] = <span style="color: #da8548; font-weight: bold;">1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org67ccef2" class="outline-3">
<h3 id="org67ccef2">Function</h3>
<div class="outline-text-3" id="text-org67ccef2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #5B6268;">//</span><span style="color: #5B6268;">! no generics for now</span>
<span style="color: #a9a1e1;">add</span> :: fn<span style="color: #51afef;">(</span>x: <span style="color: #ECBE7B;">int</span>, y: <span style="color: #ECBE7B;">int</span><span style="color: #51afef;">)</span> <span style="color: #ECBE7B;">int</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">return</span> x + y
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org763a9f9" class="outline-3">
<h3 id="org763a9f9">Enums</h3>
<div class="outline-text-3" id="text-org763a9f9">
<div class="org-src-container">
<pre class="src src-odin"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">no size specification</span>

<span style="color: #ECBE7B;">TokenType</span> :: <span style="color: #51afef;">enum</span> {
    Id,
    Number,
    Float,
    String,
    Char,
    Invalid,
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org820d377" class="outline-3">
<h3 id="org820d377">Memory Allocation (similar to C, but typed)</h3>
<div class="outline-text-3" id="text-org820d377">
<div class="org-src-container">
<pre class="src src-odin">x := <span style="color: #c678dd;">new</span> (<span style="color: #ECBE7B;">int</span>[<span style="color: #da8548; font-weight: bold;">100</span>])
<span style="color: #51afef;">defer</span> <span style="color: #c678dd;">delete</span> x
<span style="color: #51afef;">if</span> x == <span style="color: #a9a1e1;">nil</span> {
    io.println(<span style="color: #98be65;">"Fail alloc"</span>)
    os.exit(<span style="color: #da8548; font-weight: bold;">1</span>)
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3f3afd2" class="outline-2">
<h2 id="org3f3afd2">TODO</h2>
<div class="outline-text-2" id="text-org3f3afd2">
</div>
<div id="outline-container-org7418759" class="outline-3">
<h3 id="org7418759">Compiler</h3>
<div class="outline-text-3" id="text-org7418759">
<ul class="org-ul">
<li>Parser</li>
<li>TypeChecker &amp; Analysis</li>
<li>Optimization</li>
<li>CodeGen</li>
</ul>
</div>
</div>

<div id="outline-container-org36b6fe9" class="outline-3">
<h3 id="org36b6fe9">DOCS</h3>
<div class="outline-text-3" id="text-org36b6fe9">
<ul class="org-ul">
<li>Add a copy button in HTML docs export</li>
<li>Add automation to docs generation</li>
<li>Custom syntax highlighting for rotate</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
